app/views/users/show.html.erb

SELECT "achievements".* FROM "achievements" WHERE (id NOT IN (SELECT achievement_id FROM user_achievements WHERE user_id = 3))
---
      <div class="tab-pane active 1a">
        <% @user.user_achievements.each do | u_a| %>