app/views/charities/show.html.erb


<% if @charity.donations.count > 1 %>
---
SELECT "donations".* FROM "donations" WHERE "donations"."charity_id" = $1  [["charity_id", 1]]
SELECT COUNT(*) FROM "donations" WHERE "donations"."charity_id" = $1  [["charity_id", 1]]