app/controllers/charities_controller.rb

SELECT "charities".* FROM "charities"
---
  def index
    @charities = Charity.all

SELECT  "charities".* FROM "charities" WHERE "charities"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "achievements".* FROM "achievements"
SELECT "donations".* FROM "donations" WHERE "donations"."charity_id" = $1  [["charity_id", 1]]
---
  def show
    @charity = Charity.find(params[:id])
    @achievements = Achievement.all
    @donation = Donation.new
    @donation_number_stats = { 0_4 => 0, 5_9 => 0, 10_49 => 0, 50_99 => 0, 100 => 0 }
    @donation_quantity_stats = { 0_4 => 0, 5_9 => 0, 10_49 => 0, 50_99 => 0, 100 => 0 }
    require 'open-uri'
    url = "https://newsapi.org/v2/everything?q=+\"#{@charity.name}\"&language=en&sortBy=relevancy&apiKey=#{ENV['NEWS_API_KEY']}"

    req = open(url)
    @news_json = req.read
    @news_json = JSON.parse(@news_json)
    @news_articles = @news_json['articles']

    @charity.donations.each do | donation |