app/controllers/donations_controller.rb

INSERT INTO "donations" ("user_id", "charity_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["charity_id", 1], ["quantity", 10], ["created_at", "2017-11-20 18:29:10.984157"], ["updated_at", "2017-11-20 18:29:10.984157"]]
---
  def create



    @amount = params[:amount]
    @amount = @amount.gsub('$', '').gsub(',', '')

    begin
      @amount = Float(@amount).round(2)
    rescue
      flash[:error] = 'Charge not completed. Please enter a valid amount in CAD ($).'
      redirect_to new_donate_path
      return
    end

    @amount = (@amount * 100)

    if @amount > 99999999
        @amount = 99999999
    end
      @amount = @amount.to_i # Must be an integer!
     Stripe::Charge.create(
        :amount      => @amount,
        :description => 'Custom donation',
        :source => params[:stripeToken],
        :currency    => 'cad'
      )

SELECT  "charities".* FROM "charities" WHERE "charities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "charities" SET "amount" = $1, "updated_at" = $2 WHERE "charities"."id" = $3  [["amount", 500], ["updated_at", "2017-11-20 19:15:40.379977"], ["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "user_achievements".* FROM "user_achievements" WHERE "user_achievements"."user_id" = $1 ORDER BY "user_achievements"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1000]]
---

    @donation.save

    @charity = Charity.find(params[:charity_id]);
    new_amount = @charity.amount + params[:amount].to_i
    @charity.update_attributes(:amount => new_amount )
    @user = User.find(current_user.id)
    UserMailer.send_donation_receipt(@user, @donation,@charity).deliver
    UserAchievement.where(["user_id = :user_id and achieved = :achieved", { user_id: current_user.id, achieved: false }] ).find_each do |userAchievement|

UPDATE "user_achievements" SET "progress" = $1, "achieved" = $2, "updated_at" = $3 WHERE "user_achievements"."id" = $4  [["progress", 235], ["achieved", "t"], ["updated_at", "2017-11-20 21:33:13.614560"], ["id", 2]]
---
      if newProgress >= achievement.progress
        newAchieve = true
      end
      userAchievement.update_attributes(
        :progress => newProgress,
        :achieved => newAchieve
      )