app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (first_name ILIKE '%ghan%' OR last_name ILIKE '%ghan%')
---
  def index
    puts "searching..."
    @users = if params[:term]
      puts "searching for user ..."
      puts @users.inspect
      User.where('first_name ILIKE ? OR last_name ILIKE ?', "%#{params[:term]}%", "%#{params[:term]}%")

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "achievements".* FROM "achievements" WHERE (id NOT IN (SELECT achievement_id FROM user_achievements WHERE user_id = 3))
---
  def show
    @user = User.find(params[:id])
    @achievements  = Achievement.where('id NOT IN (SELECT achievement_id FROM user_achievements WHERE user_id = ?)', @user.id)

INSERT INTO "users" ("email", "first_name", "last_name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "achievements".* FROM "achievements" ORDER BY "achievements"."id" ASC LIMIT $1  [["LIMIT", 1000]]
INSERT INTO "user_achievements" ("achievement_id", "user_id", "achieved", "progress", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["achievement_id", 1], ["user_id", 4], ["achieved", "f"], ["progress", 0], ["created_at", "2017-11-20 21:05:56.525894"], ["updated_at", "2017-11-20 21:05:56.525894"]]
---
  def create
    @user = User.new(user_params)

    @user.avatar = Faker::Avatar.image
    if @user.save
      UserNotifierMailer.send_signup_email(@user).deliver
      session[:user_id] = @user.id
      session[:time] = Time.now

      Achievement.all.find_each do |achievement|
        if achievement.id == 1
          @user.user_achievements.create!(progress: 0, achieved: true, achievement_id: achievement.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "Bernard2"], ["password_digest", "$2a$10$djLTUeeTrv/8PergKKxK6e/Zkf/eCmU84G3ZbL5RadfdFXJIQgi1m"], ["updated_at", "2017-11-20 00:24:59.958676"], ["id", 12]]
---
  def update
    puts "update user"
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)